wbs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-17 Fri 23:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="milad kamali" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org017e5fe">1. Demo</a>
<ul>
<li><a href="#org483dfe5">1.1. stage one</a>
<ul>
<li><a href="#org31beca1">1.1.1. document manual process involve in this scenario</a></li>
<li><a href="#org5eca8cc">1.1.2. define gRPC routing request/response interface&#xa0;&#xa0;&#xa0;<span class="tag"><span class="design">design</span></span></a></li>
<li><a href="#org2e0c6d0">1.1.3. implement a mock solver which returns specific response</a></li>
<li><a href="#org0939f27">1.1.4. implement simple solver</a></li>
<li><a href="#org5085388">1.1.5. a simple gRPC server which handles communication between solver</a></li>
</ul>
</li>
<li><a href="#org83d90f7">1.2. stage two</a>
<ul>
<li><a href="#org072987a">1.2.1. set up a minimal plant3D</a></li>
<li><a href="#org7abc18e">1.2.2. write a simple plugin that comminicates with the server that is developed in previous stage</a></li>
</ul>
</li>
<li><a href="#org9b54da8">1.3. stage three</a>
<ul>
<li><a href="#orgdba2134">1.3.1. define the basic workflow of the user</a></li>
<li><a href="#org8dd6320">1.3.2. implement export module</a></li>
<li><a href="#org61fd6f1">1.3.3. implement scene interaction module</a></li>
<li><a href="#org1d0491e">1.3.4. implement user interface module</a></li>
<li><a href="#org92b2912">1.3.5. implement basic communication module</a></li>
<li><a href="#org02f2545">1.3.6. implement basic Data conversion module</a></li>
<li><a href="#org9e79009">1.3.7. implement basic orchestrator</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org017e5fe" class="outline-2">
<h2 id="org017e5fe"><span class="section-number-2">1.</span> Demo</h2>
<div class="outline-text-2" id="text-1">
<p>
A minimal working prototype connecting a solver to the plant3D which export a
simple scene  and connects them using specific pipes
</p>
</div>
<div id="outline-container-org483dfe5" class="outline-3">
<h3 id="org483dfe5"><span class="section-number-3">1.1.</span> stage one</h3>
<div class="outline-text-3" id="text-1-1">
<p>
a simple scene with only two components each of which has only one input. This
stage requires almost no setup in plant3D and it's the fastest way of achiving
proof of concept.
</p>
</div>
<div id="outline-container-org31beca1" class="outline-4">
<h4 id="org31beca1"><span class="section-number-4">1.1.1.</span> document manual process involve in this scenario</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="org6dfe65e"></a>manually export components and their inputs into a excel file<br /></li>
<li><a id="orgedf59c7"></a>manually import this PCF structure into plant3D<br /></li>
</ol>
</div>
<div id="outline-container-org5eca8cc" class="outline-4">
<h4 id="org5eca8cc"><span class="section-number-4">1.1.2.</span> define gRPC routing request/response interface&#xa0;&#xa0;&#xa0;<span class="tag"><span class="design">design</span></span></h4>
</div>
<div id="outline-container-org2e0c6d0" class="outline-4">
<h4 id="org2e0c6d0"><span class="section-number-4">1.1.3.</span> implement a mock solver which returns specific response</h4>
</div>
<div id="outline-container-org0939f27" class="outline-4">
<h4 id="org0939f27"><span class="section-number-4">1.1.4.</span> implement simple solver</h4>
<div class="outline-text-4" id="text-1-1-4">
</div>
<ol class="org-ol">
<li><a id="org1d81b0c"></a>solver implementation in any possible language<br /></li>
<li><a id="orge0a1731"></a>implement solver gRPC stubs to communicate with server<br /></li>
</ol>
</div>
<div id="outline-container-org5085388" class="outline-4">
<h4 id="org5085388"><span class="section-number-4">1.1.5.</span> a simple gRPC server which handles communication between solver</h4>
<div class="outline-text-4" id="text-1-1-5">
</div>
<ol class="org-ol">
<li><a id="org26ff703"></a>setup gRPC server/client stubs<br /></li>
<li><a id="org176909a"></a>convert the export excel into a routing request<br /></li>
<li><a id="orgdb30f4a"></a>communicate with solver to get the routing response<br /></li>
<li><a id="org660cd50"></a>convert the roating response into PCF format<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org83d90f7" class="outline-3">
<h3 id="org83d90f7"><span class="section-number-3">1.2.</span> stage two</h3>
<div class="outline-text-3" id="text-1-2">
<p>
this stage requires very basic understanding and set up in plant3D, however it's
the foundation of furthure development. here we want very simple plugin that
eithre using a simple time or a simple button in the screen dose the import and export of the pcf
</p>
</div>
<div id="outline-container-org072987a" class="outline-4">
<h4 id="org072987a"><span class="section-number-4">1.2.1.</span> set up a minimal plant3D</h4>
<div class="outline-text-4" id="text-1-2-1">
</div>
<ol class="org-ol">
<li><a id="org93c8e37"></a>install a working version of plant3D on windows<br /></li>
<li><a id="orgedf9316"></a>setup Visual studio to develop plant3D plugin<br /></li>
<li><a id="orgb3d46b2"></a>setup required SKD in visual studio<br /></li>
<li><a id="orgc27675c"></a>write a hello word plugin in plant3D<br /></li>
</ol>
</div>
<div id="outline-container-org7abc18e" class="outline-4">
<h4 id="org7abc18e"><span class="section-number-4">1.2.2.</span> write a simple plugin that comminicates with the server that is developed in previous stage</h4>
<div class="outline-text-4" id="text-1-2-2">
</div>
<ol class="org-ol">
<li><a id="org81e02c1"></a>write a simple component that export component list into excel file in specific folder<br />
<ol class="org-ol">
<li><a id="org1714b56"></a>find the appropriate documentation regarding component export in SDK<br /></li>
<li><a id="orga416855"></a>define proper interface for the component<br /></li>
<li><a id="org5ac93d3"></a>component implementation<br /></li>
</ol>
</li>
<li><a id="org9b7d2c3"></a>write a simple component that automatically imports PCF from specific folder<br />
<ol class="org-ol">
<li><a id="org2c8e04a"></a>find the appropriate documentation<br /></li>
<li><a id="orge12852e"></a>define proper interface for the component<br /></li>
<li><a id="org6f2dff6"></a>component implementation<br /></li>
</ol>
</li>
<li><a id="orgd100edd"></a>write a simple UI with two buttons to export components and import PCF from server<br />
<ol class="org-ol">
<li><a id="org129c3d1"></a>Research about creating UI window and elements and event handling<br /></li>
<li><a id="orgc47f1c0"></a>Implement the popup window and connect it to the components<br /></li>
</ol>
</li>
</ol>
</div>
</div>
<div id="outline-container-org9b54da8" class="outline-3">
<h3 id="org9b54da8"><span class="section-number-3">1.3.</span> stage three</h3>
<div class="outline-text-3" id="text-1-3">
<p>
the goal of this stage is to provide improved UI/UX for the user and this the
begining stage of actaully providing a proper plugin that can be given to
customers. in this stage a series of module for proper architecture and
separation of tasks are introduced.
</p>
</div>
<div id="outline-container-orgdba2134" class="outline-4">
<h4 id="orgdba2134"><span class="section-number-4">1.3.1.</span> define the basic workflow of the user</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
goal here is to specify how the user is going to interact with our system, for
instance we could ask the user to chose the starting point and click on a button
then select the target and click on a button then press an other button to view
a preview of the routing. This task requires some UI/UX design
</p>
</div>
</div>
<div id="outline-container-org8dd6320" class="outline-4">
<h4 id="org8dd6320"><span class="section-number-4">1.3.2.</span> implement export module</h4>
<div class="outline-text-4" id="text-1-3-2">
</div>
<ol class="org-ol">
<li><a id="org9d20ab1"></a>design export module interfaces<br />
<ol class="org-ol">
<li><a id="org0756114"></a>interface for exporting scene components<br /></li>
<li><a id="org47c2ceb"></a>interface for exporting component information<br /></li>
<li><a id="orgbb9ae92"></a>interface for exporting component exclusion or proximity zones<br /></li>
<li><a id="org54a5894"></a>interface for exporting exclusion zones of the scene<br /></li>
<li><a id="orge596e46"></a>interface for checking collisions with the exclusion zones<br /></li>
<li><a id="org33366ed"></a>interface for listing all the objects in the scene<br /></li>
<li><a id="org316fc08"></a>interface for interrogating an object<br /></li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org61fd6f1" class="outline-4">
<h4 id="org61fd6f1"><span class="section-number-4">1.3.3.</span> implement scene interaction module</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
this module is supposed to separate object and scene manipulation actions from
the rest of the plugin
</p>
</div>
<ol class="org-ol">
<li><a id="org0f27be9"></a>design scene interaction module interface<br />
<ol class="org-ol">
<li><a id="org0ff9683"></a>interface to update an object property<br /></li>
<li><a id="orgab533c8"></a>interface to move/rotate objects<br /></li>
<li><a id="org3f52a67"></a>&#x2026;<br /></li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org1d0491e" class="outline-4">
<h4 id="org1d0491e"><span class="section-number-4">1.3.4.</span> implement user interface module</h4>
<div class="outline-text-4" id="text-1-3-4">
</div>
<ol class="org-ol">
<li><a id="org15e5264"></a>research and document plant3D user interface<br /></li>
<li><a id="orgd462e91"></a>design user interface elements and signals for user interface module<br /></li>
<li><a id="org7f72411"></a>design module interface<br />
<div class="outline-text-5" id="text-1-3-4-3">
<p>
this supposed to separate detail implementation of plant3D SDK from the rest of the plugin
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org92b2912" class="outline-4">
<h4 id="org92b2912"><span class="section-number-4">1.3.5.</span> implement basic communication module</h4>
</div>
<div id="outline-container-org02f2545" class="outline-4">
<h4 id="org02f2545"><span class="section-number-4">1.3.6.</span> implement basic Data conversion module</h4>
</div>
<div id="outline-container-org9e79009" class="outline-4">
<h4 id="org9e79009"><span class="section-number-4">1.3.7.</span> implement basic orchestrator</h4>
<div class="outline-text-4" id="text-1-3-7">
<p>
this module is supposed to handles events and communication between solver
plant3D and other modules
</p>
</div>
<ol class="org-ol">
<li><a id="org1c5bd7a"></a>design orchestrator workflow based on user interactions<br /></li>
<li><a id="org166ffda"></a>connect export module to the workflow<br /></li>
<li><a id="org808adb0"></a>connect user interface module to the orchestrator<br /></li>
<li><a id="orgf0c2a54"></a>connect scene interaction module to the orchestrator<br /></li>
<li><a id="orga5a965d"></a>connect communication module to the orchestrator<br /></li>
<li><a id="org9997aa1"></a>implement orchestrator workflow<br /></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: milad kamali</p>
<p class="date">Created: 2022-06-17 Fri 23:14</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
